DataProcessors/ОбменДанными2КБухгалтерия77.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<DataProcessor>
		<Properties>
			<Name>ОбменДанными2КБухгалтерия77</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдрессFTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьВидыОплат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьМеню</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьРестораны</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьСебестоимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьСотрудников</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьСохранятьФайлыНаFTP</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьТипыЦен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформационнаяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВыводитьСообщения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОбновлятьНаименованиеНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОбновлятьНоменклатурныеГруппыНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодВыгрузки</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолностьюОбновлятьСотрудников</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимВыгрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимЗагрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ресторан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Рестораны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СекторнаяВерсия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ОбменДанными2КБухгалтерия77/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Функция ЗначениеФормыЗаполнено(ИмяРеквизита, ПредставлениеРеквизита)
	
	Если НЕ ЗначениеЗаполнено(Объект[ИмяРеквизита]) Тогда
	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Поле	= ИмяРеквизита;
		Сообщение.Текст = "Не заполнен """+ПредставлениеРеквизита+""".";
		Сообщение.УстановитьДанные(Объект);
		Сообщение.Сообщить();
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;

КонецФункции

&НаСервере
Процедура ЗагрузитьНаСервере()
	
	Если НЕ ЭтаФорма.ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	//ОбъектКопия = ДанныеФормыВЗначение(Объект,Тип("ОбработкаОбъект.ОбменДанными2КБухгалтерия77"));
	ОбъектКопия = РеквизитФормыВЗначение("Объект"); //Костенюк Александр 07.11.2013
	ОбъектКопия.ВывестиСообщение("Началась в "+Формат(ТекущаяДата(),"ДЛФ=В"));
	ОбъектКопия.ВыполнитьЗагрузку();
	ОбъектКопия.ВывестиСообщение("Закончилась в "+Формат(ТекущаяДата(),"ДЛФ=В"));
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтаФорма, Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")); //Костенюк Александр 07.11.2013
	ЗагрузитьНаСервере();
	ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации); //Костенюк Александр 07.11.2013
	
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьНаСервере()
	
	Если НЕ ЭтаФорма.ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	//ОбъектКопия = ДанныеФормыВЗначение(Объект,Тип("ОбработкаОбъект.ОбменДанными2КБухгалтерия77"));
	//ОбъектКопия.ВывестиСообщение("Началась в "+Формат(ТекущаяДата(),"ДЛФ=В"));
	//ОбъектКопия.ВыполнитьВыгрузку();
	//ОбъектКопия.ВывестиСообщение("Закончилась в "+Формат(ТекущаяДата(),"ДЛФ=В"));
	
	//Костенюк Александр-Старт 05.11.2014
	ОбъектКопия = РеквизитФормыВЗначение("Объект");
	ОбъектКопия.ВыполнитьВыгрузку(НачалоДня(Объект.ПериодВыгрузки.ДатаНачала), КонецДня(Объект.ПериодВыгрузки.ДатаОкончания), Объект.Ресторан, Объект.КаталогОбмена, Объект.АдрессFTP, Объект.Пользователь, Объект.Пароль, Объект.ЗагружатьСохранятьФайлыНаFTP, , Объект.СекторнаяВерсия, Объект.ИнформационнаяСистема, Объект.РежимВыгрузки);
	//Костенюк Александр-Финиш 05.11.2014
	
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	
	////Костенюк Александр-Старт 03.06.2014
	//Если НЕ ЗначениеЗаполнено(Объект.Ресторан) Тогда
	//	Сообщить("Не заполнено поле " +""""+"Ресторан"+"""");
	//	Возврат;
	//КонецЕсли;
	////Костенюк Александр-Финиш 03.06.2014
	
	ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтаФорма, Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")); //Костенюк Александр 07.11.2013
	ВыгрузитьНаСервере();
	ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации); //Костенюк Александр 07.11.2013
	
КонецПроцедуры

&НаКлиенте
Процедура ПрефиксФайловПриИзменении(Элемент)
	
	ПрефиксФайлов = СокрЛП(ПрефиксФайлов);
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогОбменаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка	= Ложь;
	Диалог					= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Каталог			= Объект.КаталогОбмена;
	Диалог.ПроверятьСуществованиеФайла = Истина;
	
	Если Диалог.Выбрать() Тогда
		//Объект.КаталогОбмена = Диалог.Каталог;
		Объект.КаталогОбмена = РаботаСФайлами.НормализоватьКаталог(СокрЛП(Диалог.Каталог)); //Костенюк Александр 10.11.2014
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	Хранилище = Новый ХранилищеЗначения(Настройки);
	Константы.ОбменСБухгалтериейНастройки.Установить(Хранилище);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагружатьСотрудниковПриИзменении(Элемент)
	Элементы.ПолностьюОбновлятьСотрудников.Видимость = Объект.ЗагружатьСотрудников;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗагружатьСотрудниковПриИзменении(Неопределено);
КонецПроцедуры

&НаСервере
//Костенюк Александр-Старт 07.05.2013
//
// Процедура восстанавливает настройки обработки
// 
// Параметры:
// Нет.
// 
Процедура ВосстановитьНастройкиНаСервере()
	
	Хранилище = Константы.ОбменСБухгалтериейНастройки.Получить();
	Соответствие = Хранилище.Получить();
	
	Если Соответствие = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.НеОбновлятьНаименованиеНоменклатуры = Соответствие["Объект.НеОбновлятьНаименованиеНоменклатуры"];
	Объект.НеОбновлятьНоменклатурныеГруппыНоменклатуры = Соответствие["Объект.НеОбновлятьНоменклатурныеГруппыНоменклатуры"];
	
	ОбработкаОбъект 				= РеквизитФормыВЗначение("Объект");
	Объект.ИнформационнаяСистема 	= Константы.ОсновнаяИнформационнаяСистема.Получить();
	Объект.СекторнаяВерсия 			= Константы.СекторнаяВерсияБухгалтерии.Получить();
	Объект.АдрессFTP				= ОбработкаОбъект.ПолучитьАдрес();
	Объект.Пользователь 			= ОбработкаОбъект.ПолучитьПользователя();
	Объект.Пароль 					= ОбработкаОбъект.ПолучитьПароль();
	Объект.КаталогОбмена			= ОбработкаОбъект.ПолучитьКаталог();
	
КонецПроцедуры
//Костенюк Александр-Финиш 07.05.2013

&НаКлиенте
//Костенюк Александр-Старт 07.05.2013
Процедура УстановитьВидимость()
	
	УстановитьВидимостьНаСервере();
	
КонецПроцедуры // УстановитьВидимость()
//Костенюк Александр-Финиш 07.05.2013

&НаСервере
//Костенюк Александр-Старт 07.05.2013
Процедура УстановитьВидимостьНаСервере()
	
	Элементы.НеОбновлятьНаименованиеНоменклатуры.Видимость = РольДоступна("ПолныеПрава");
	Элементы.НеОбновлятьНоменклатурныеГруппыНоменклатуры.Видимость = РольДоступна("ПолныеПрава");
	Элементы.РежимЗагрузки.Видимость = РольДоступна("ПолныеПрава");
	
КонецПроцедуры // УстановитьВидимостьНаСервере()
//Костенюк Александр-Финиш 07.05.2013

&НаКлиенте
//Костенюк Александр-Старт 03.06.2014
Процедура РесторанПриИзменении(Элемент)
	РесторанПриИзмененииНаСервере();
КонецПроцедуры
//Костенюк Александр-Финиш 03.06.2014

&НаСервере
//Костенюк Александр-Старт 02.10.2014
Процедура РесторанПриИзмененииНаСервере()
	Объект.ПрефиксФайлов = ?(ЗначениеЗаполнено(Объект.Ресторан.Префикс), СокрЛП(Объект.Ресторан.Префикс), "");
КонецПроцедуры
//Костенюк Александр-Финиш 02.10.2014

//Костенюк Александр-Старт 31.03.2015
&НаКлиенте
Процедура РежимВыгрузкиПриИзменении(Элемент)
	Объект.Ресторан = ?(Объект.РежимВыгрузки = 1, Неопределено, Объект.Ресторан);
	РесторанПриИзмененииНаСервере();
	УстановитьДоступностьНаСервере();
КонецПроцедуры
//Костенюк Александр-Финиш 31.03.2015

//Костенюк Александр-Старт 31.03.2015
&НаСервере
Процедура УстановитьДоступностьНаСервере()
	Элементы.Ресторан.Доступность = НЕ (Объект.РежимВыгрузки = 1);	
КонецПроцедуры
//Костенюк Александр-Финиш 31.03.2015 

//Костенюк Александр-Старт 31.03.2015
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.РежимЗагрузки = 1;
	Объект.РежимВыгрузки = 1;
	
	РесторанПриИзмененииНаСервере();
	ВосстановитьНастройкиНаСервере();
	УстановитьВидимостьНаСервере();
	УстановитьДоступностьНаСервере();
	
КонецПроцедуры
//Костенюк Александр-Финиш 31.03.2015
